#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.web_apps.azurerm_redis_cache_access_policy_assignment.etl_func will be created
  + resource "azurerm_redis_cache_access_policy_assignment" "etl_func" {
      + access_policy_name = "Data Contributor"
      + id                 = (known after apply)
      + name               = "etl_func"
      + object_id          = "42a26240-ee65-4929-889d-f5fd6cafbe85"
      + object_id_alias    = "ServicePrincipal"
      + redis_cache_id     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Cache/redis/io-p-itn-msgs-redis-01"
    }

  # module.web_apps.azurerm_role_assignment.key_vault_etl_func_secrets_user will be created
  + resource "azurerm_role_assignment" "key_vault_etl_func_secrets_user" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "42a26240-ee65-4929-889d-f5fd6cafbe85"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (31 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01"
        name                                           = "io-p-itn-msgs-sending-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (32 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
          ~ health_check_eviction_time_in_min       = 0 -> 2
            # (25 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps.module.etl_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "NODE_ENV"                                        = "production"
          - "NODE_ENVIRONMENT"                                = "production" -> null
          + "PDV_TOKENIZER_API_KEY"                           = "@Microsoft.KeyVault(VaultName=io-p-kv-common;SecretName=func-elt-PDV-TOKENIZER-API-KEY)"
          + "REDIS_ACCESS_KEY"                                = (sensitive value)
          + "REDIS_PING_INTERVAL"                             = "540000"
          + "REDIS_URL"                                       = "rediss://io-p-itn-msgs-redis-01.redis.cache.windows.net:6380"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-etl-func-01"
        name                                           = "io-p-itn-com-etl-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.redis_messages.azurerm_redis_cache.this,
  on .terraform/modules/redis_messages/redis_cache/main.tf line 7, in resource "azurerm_redis_cache" "this":
   7:   enable_non_ssl_port           = var.enable_non_ssl_port

`enable_non_ssl_port` will be removed in favour of the property
`non_ssl_port_enabled` in version 4.0 of the AzureRM Provider.

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
